000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. fileIODemo.
000003 AUTHOR. Nathan Kernan.
000004
000005 ENVIRONMENT DIVISION.
000006 INPUT-OUTPUT SECTION.
000007 FILE-CONTROL.
000008     SELECT  OUT-FILE ASSIGN TO "outputFile.txt"
000009         ORGANIZATION IS LINE SEQUENTIAL.
000010 
000011 DATA DIVISION.
000012 FILE SECTION.
000013 FD OUT-FILE.
000014 01 OUT-REC PIC X(40).
000015 WORKING-STORAGE SECTION.
000016 01 WS-MESSAGE PIC X(40) VALUE "Testing TESTING.".
000017 
000018 PROCEDURE DIVISION.
000019     OPEN OUTPUT OUT-FILE
000020     MOVE WS-MESSAGE to OUT-REC
000021     WRITE OUT-REC
000022     CLOSE OUT-FILE
000023     DISPLAY "Wrote to outFile.txt"
000024     
000025     STOP RUN.
000026
000027 END PROGRAM fileIODemo.