000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. salesReport.
000003 AUTHOR. Nathan Kernan.
000004
000005 DATA DIVISION.
000006 WORKING-STORAGE SECTION.
000007 01 SALES-AMOUNT     PIC 9(5)V99 VALUE 0.
000008 01 TAX-RATE         PIC 9(3)V99 VALUE 15.00.
000009 01 TAX-AMOUNT       PIC 9(5)V99 VALUE 0.
000010 01 TOTAL-AMOUNT     PIC 9(5)V99 VALUE 0.
000011
000012 PROCEDURE DIVISION.
000013     DISPLAY "Enter sales amount: $" WITH NO ADVANCING
000014     ACCEPT SALES-AMOUNT
000015     COMPUTE TAX-AMOUNT = SALES-AMOUNT * TAX-RATE / 100
000016     COMPUTE TOTAL-AMOUNT = SALES-AMOUNT + TAX-AMOUNT
000017     DISPLAY "Sales: $" SALES-AMOUNT
000018     DISPLAY "Tax:   $" TAX-AMOUNT
000019     DISPLAY "-----------------"
000020     DISPLAY "Total: $" TOTAL-AMOUNT
000021
000022     STOP RUN.
000023 
000024 END PROGRAM salesReport.


