000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. simpleCalculator.
000003 AUTHOR. Nathan Kernan.
000004 
000005 DATA DIVISION.
000006 WORKING-STORAGE SECTION.
000007 01 NUM1      PIC 9(5)V9999.
000008 01 NUM2      PIC 9(5)V9999.
000009 01 RESULT    PIC 9(6)V9999.
000010 01 OPERATION PIC X.
000011
000012 PROCEDURE DIVISION.
000013     DISPLAY "Enter first number: ".
000014     ACCEPT NUM1.
000015     DISPLAY "Enter second number: ".
000016     ACCEPT NUM2.
000017     DISPLAY "Enter operation (+, -, *, /): ".
000018     ACCEPT OPERATION.
000019
000020     EVALUATE OPERATION
000021         WHEN "+"
000022             COMPUTE RESULT = NUM1 + NUM2
000023             DISPLAY "Result: " RESULT
000024         WHEN "-"
000025             COMPUTE RESULT = NUM1 - NUM2
000026             DISPLAY "Result: " RESULT
000027         WHEN "*"
000028             COMPUTE RESULT = NUM1 * NUM2
000029             DISPLAY "Result: " RESULT
000030         WHEN "/"
000031             IF NUM2 = 0
000032                 DISPLAY "Cannot divide by zero."
000033             ELSE
000034                 COMPUTE RESULT = NUM1 / NUM2
000035                 DISPLAY "Result: " RESULT
000036             END-IF
000037         WHEN OTHER
000038             DISPLAY "Invalid operation."
000039     END-EVALUATE.
000040
000041     STOP RUN.
000042 
000043 END PROGRAM simpleCalculator.