000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. stringManipulation.
000003 AUTHOR. Nathan Kernan.
000004 
000005 DATA DIVISION.
000006 WORKING-STORAGE SECTION.
000007 01 FIRST-NAME   PIC X(10) VALUE "Nathan".
000008 01 LAST-NAME    PIC X(15) VALUE "Kernan".
000009 01 FULL-NAME    PIC X(26).
000010 
000011 PROCEDURE DIVISION.
000012     STRING FIRST-NAME DELIMITED BY SPACE
000013         " " DELIMITED BY SIZE
000014         LAST-NAME DELIMITED BY SPACE
000015         INTO FULL-NAME
000016     DISPLAY "Full name: " FULL-NAME
000017     
000018     STOP RUN.
000019
000020 END PROGRAM stringManipulation.